app/views/OWS/Reservation/FetchBookedPackages.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:res="http://webservices.micros.com/ows/5.1/Reservation.wsdl">
   <soapenv:Header>
      <core:OGHeader transactionID="{transactionID}" primaryLangID="E" timeStamp="{timeStamp}" xmlns="http://webservices.micros.com/og/4.3/Core/">
        	<Origin entityID="{hotelCode}" systemType="WEB"/>
         	<Destination entityID="{hotelCode}" systemType="PMS"/>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <res:FetchBookedPackagesRequest>
         <res:HotelReference chainCode="{chainCode}" hotelCode="{hotelCode}"></res:HotelReference>
         <res:ConfirmationNumber>{ConfirmationNumber}</res:ConfirmationNumber>
      </res:FetchBookedPackagesRequest>
   </soapenv:Body>
</soapenv:Envelope>